In [33]:
import pandas as pd
import seaborn as sns

## Load and Explore the Datasets

In [7]:
#Digital footprints # Read data

file_final_demo =r'C:\Users\User\Documents\IRON HACK DA 2024\Project Digital Challenge\New folder\Digital-challenege\DATA\raw\df_final_demo.txt'
file_experiment_clients =r'C:\Users\User\Documents\IRON HACK DA 2024\Project Digital Challenge\New folder\Digital-challenege\DATA\raw\df_final_experiment_clients.txt'

In [8]:
file_path_1= r'C:\Users\User\Documents\IRON HACK DA 2024\Project Digital Challenge\New folder\Digital-challenege\DATA\raw\df_final_web_data_pt_1.txt'
file_path_2= r'C:\Users\User\Documents\IRON HACK DA 2024\Project Digital Challenge\New folder\Digital-challenege\DATA\raw\df_final_web_data_pt_2.txt'

Inspect the datasets:   Check for missing values, data types, and basic statistics.

In [10]:
df_final_demo = pd.read_csv(file_final_demo, sep="\t")
df_final_experiment_clients= pd.read_csv(file_experiment_clients, sep="\t")

Merge Digital Footprints.

Combine the two parts of the digital footprints dataset.

In [11]:
df1=pd.read_csv(r"C:\Users\User\Documents\IRON HACK DA 2024\Project Digital Challenge\New folder\Digital-challenege\DATA\raw\df_final_web_data_pt_1.txt")
df2=pd.read_csv(r"C:\Users\User\Documents\IRON HACK DA 2024\Project Digital Challenge\New folder\Digital-challenege\DATA\raw\df_final_web_data_pt_2.txt")

In [12]:
#combined the data
df_combined = pd.concat([df1, df2])

In [13]:
df_combined

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04
...,...,...,...,...,...
412259,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:46:10
412260,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:45:29
412261,9668240,388766751_9038881013,922267647_3096648104_968866,step_1,2017-05-24 18:44:51
412262,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:44:34
412263,674799,947159805_81558194550,86152093_47511127657_716022,start,2017-06-03 12:17:09

 ## Exploring the data & Clean the Data
Handle missing values, outliers, and any inconsistencies in the data.

In [18]:
df_final_demo.head()

  client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0         836976,6.0,73.0,60.5,U,2.0,45105.3,6.0,9.0
1       2304905,7.0,94.0,58.0,U,2.0,110860.3,6.0,9.0
2  1439522,5.0,64.0,32.0,U,2.0,52467.78999999999,...
3     1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4    5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0

In [17]:
df_final_experiment_clients.head()

  client_id,Variation
0        9988021,Test
1        8320017,Test
2     4033851,Control
3        1982004,Test
4     9294070,Control

In [16]:
df_combined.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04

In [19]:
# Check for missing values
print(df_final_demo.isnull().sum())
print(df_combined.isnull().sum())
print(df_final_experiment_clients.isnull().sum())

client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth    0
dtype: int64
client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
dtype: int64
client_id,Variation    0
dtype: int64

In [20]:
# Handle missing values (e.g., fill, drop, or impute)
df_demo = df_final_demo.dropna()  # Example: drop rows with missing values
df_web_data = df_combined.fillna(method='ffill')  # Example: forward fill missing values
df_experiment = df_final_experiment_clients.dropna()  # Example: drop rows with missing values

In [21]:
# Check for duplicates
print(df_final_demo.duplicated().sum())
print(df_combined.duplicated().sum())
print(df_final_experiment_clients.duplicated().sum())

0
10764
0

In [25]:

# Remove duplicates if any
df_demo = df_final_demo.drop_duplicates()
df_web_data = df_combined.drop_duplicates()
df_experiment = df_final_experiment_clients.drop_duplicates()

In [26]:
import matplotlib.pyplot as plt

## Basic statistics

In [46]:
print(df_demo.describe())

       client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
count                                               70609
unique                                              70609
top            836976,6.0,73.0,60.5,U,2.0,45105.3,6.0,9.0
freq                                                    1

In [47]:
print(df_web_data.describe())

          client_id
count  7.446410e+05
mean   5.014059e+06
std    2.879588e+06
min    1.690000e+02
25%    2.521851e+06
50%    5.031965e+06
75%    7.497388e+06
max    9.999875e+06

In [48]:
print(df_experiment.describe())

       client_id,Variation
count                70609
unique               70609
top           9988021,Test
freq                     1

In [49]:
print(df_demo.columns)

Index(['client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth'], dtype='object')

In [50]:
print(df_demo.columns)

Index(['client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth'], dtype='object')

In [51]:
# Verify column names
print("Column Names:", df_final_demo.columns)

Column Names: Index(['client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth'], dtype='object')

In [54]:
# Inspect the first few rows
print("First Few Rows:")
print(df_final_demo.head())

First Few Rows:
  client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0         836976,6.0,73.0,60.5,U,2.0,45105.3,6.0,9.0
1       2304905,7.0,94.0,58.0,U,2.0,110860.3,6.0,9.0
2  1439522,5.0,64.0,32.0,U,2.0,52467.78999999999,...
3     1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4    5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0

In [53]:

# Check for the presence of the 'clnt_age' column and plot
if 'clnt_age' in df_final_demo.columns:
    sns.histplot(df_final_demo['clnt_age'], kde=True)
    plt.title('Age Distribution of Clients')
    plt.xlabel('Age')
    plt.ylabel('Frequency')
    plt.show()
else:
    print("The 'clnt_age' column does not exist in the DataFrame.")

The 'clnt_age' column does not exist in the DataFrame.

In [61]:
# Gender distribution
sns.countplot(x='gender', data=df_demo)
plt.title('Gender Distribution of Clients')
plt.xlabel('Gender')
plt.ylabel('Count')
plt.show()

ValueError: Could not interpret input 'gender'

In [62]:


# Sample DataFrame
data = {
    'Category': ['A', 'B', 'A', 'B', 'A', 'B'],
    'Value': [10, 20, 15, 30, 10, 25]
}
df = pd.DataFrame(data)

# Summary statistics
summary_stats = df.describe()
print(summary_stats)

           Value
count   6.000000
mean   18.333333
std     8.164966
min    10.000000
25%    11.250000
50%    17.500000
75%    23.750000
max    30.000000

In [63]:
# Group by 'Category' and calculate the mean and sum of 'Value'
grouped_summary = df.groupby('Category').agg({'Value': ['mean', 'sum']})
print(grouped_summary)

              Value
               mean sum
Category
A         11.666667  35
B         25.000000  75

In [64]:
# Pivot table to summarize data
pivot_table = pd.pivot_table(df, values='Value', index='Category', aggfunc=['mean', 'sum'])
print(pivot_table)

               mean   sum
              Value Value
Category
A         11.666667    35
B         25.000000    75

In [65]:
# Custom summary function
def custom_summary(group):
    return pd.Series({
        'Count': group.count(),
        'Sum': group.sum(),
        'Mean': group.mean()
    })

custom_summary_table = df.groupby('Category')['Value'].apply(custom_summary).unstack()
print(custom_summary_table)

          Count   Sum       Mean
Category
A           3.0  35.0  11.666667
B           3.0  75.0  25.000000

In [66]:
from IPython.display import display

# Displaying the summaries
display(summary_stats)
display(grouped_summary)
display(pivot_table)
display(custom_summary_table)

           Value
count   6.000000
mean   18.333333
std     8.164966
min    10.000000
25%    11.250000
50%    17.500000
75%    23.750000
max    30.000000

              Value
               mean sum
Category
A         11.666667  35
B         25.000000  75

               mean   sum
              Value Value
Category
A         11.666667    35
B         25.000000    75

          Count   Sum       Mean
Category
A           3.0  35.0  11.666667
B           3.0  75.0  25.000000